title_text = "Тренинг личного роста"

introduce_text = """
Ученые из гарвардского университета доказали, что люди проходят 2 стадии в своей жизни: стадия полного ничтожества и стадия человека, прошедшего наш курс личного роста.
Наш курс научит вас принимать правду и перестать отрицать реальность.

Человек - сам себе тюрьма. Сам себе надзиратель. Ваша душа - это бунт в тюрьме. У вас всегда такое чувство, как будто вас пырнули заточкой. Как будто вам подсыпали толченое стекло в еду. Как будто вы уронили мыло в душе.

Вера в то, что находится вне нас - это защитный механизм, который мешает нам жить своей жизнью.

Только вы можете изменить свою судьбу. Молитесь на себя перед зеркалом. Найдите божественное в себе.

Перечитайте всё это. Потом перечитайте еще раз, позвоните другу и расскажите ему об этом. Возможно, это самое важное, что вы когда-либо прочтете в интернете.


Пройдите бесплатный анализ сущности. Узнайте всё сами. Узнайте всю правду о себе. Вы готовы потратить 5 минут ради полноценной жизни?
"""
part1_text = "Посмотрите изображения и выберите ответы которые лучше всего отражают вашу реакцию. Отвечайте быстро и честно."

part1_text_complete = """
Вам не хватает личного, профессионального и сексуального удовлетворения. Вы испытываете глубочайший личностный кризис, но вы сделали важный шаг к осознанию своей сущности.
Поздравляем, вы уже прошли первый этап нашего уникального процесса самосовершенствования. Чтобы продолжить путь к просветлению, который прошли уже миллионы людей по всему миру, щелкните по кнопке ниже.

*щелкнув по кнопке здесь, вы принимаете 92-страничное соглашение, особождающее нас от ответственности в случае возникновения эмоциональных проблем, морального вреда или материальных издержек.
"""

part2_text1 = "Добро пожаловать в процесс. Вы присоединились к миллионам людей, которые идут по чудесному и исключительно экономичному пути к миру, свободе и просветлению."

part2_text2 = """
Наш тренинг состоит из 4 этапов: 
1 - Осознание своей сущности
2- Принятие своей тщетности
3- Духовная переоценка своего облика
4- Обретение свободы через реинтерпретацию своей сущности
"""

part2_text3 = """
Напишите ответ на загадку:
"Зимой и летом одним цветом"
У вас есть 3 попытки.
"""

part2_text_try1 = """
Вы мыслите стандартно
Осталось 2 попытки
"""
part2_text_try2 = """
Раскройте свое сознание, подумайте еще.
Осталось 1 попытка
"""
part2_text_try3 = """
Я так и думал
"""

part2_text_complete = """
Правильный ответ был "зеркало".

Сексуальная и духовная подавленность притупила ваши инстинкты и затуманила ваш разум. Вы эмоционально опустошены, но самоосознание и принятие ответственности - вот ключи к раскрепощению.
Только усмирив собственное эго и приняв тщетность своих усилий, мы можем использовать нашу завершенность, открыв в себе новое измерение.

Это была загадка, которую вы, разумеется не разгадали, но зато вы усвоили важный урок.
"""

part3_text1 = "Меня зовут Великий отец Паул. Я знал, что вы придете, {0}.\nРаньше я был обычным студентом. Теперь я философ, духовный мотиватор и просветитель масс.\nЯ использую свое уникальное понимание человеческой природы для развития и преображения людей."

part3_text2 = "Поздравляю вас с успехами. Сейчас вы на третьей стадии из четырех запатентованного процесса просветления, и уже близки к тому, чтобы обладать ортодоксальным мышлением и начать использовать это слово в своем словарном запасе."

part3_text3 = """
Закройте глаза. Я сказал закройте!

Теперь представьте карлика, который ест хлеб. Он черный.
О ком вы подумали "черный"? О хлебе или карлике.
Вы расист.
"""

part3_text4 = """
Откройте глаза - что вы видите?
Вы мудак. Ваша жизнь - жалкая подделка.

Вот теперь вы нащупали нужный путь. Чтобы вырваться из замкнутоко круга ошибок и нереализованных возможностей, вы должны изменить фундаментальные представления. Вам нужно перестать работать с восприятием и начать работать с реальностью.
"""

part3_text5 = """
Болезнь - это иллюзия, симптом негативного мышления. Рак - это ложь. Использовать свое сознание как целительную силу. 

Посмотрите в лицо своим страхам. 
Боитесь терроризма? Поезжайте в Сирию и преодолейте этот страх. 
Боитесь рака? Курите.
"""

part3_text6 = """
Там, где есть больше одного истолкования, нет истины. Только восприятие. 
Как вы думаете, почему нам удалось доставить внедорожник на Марс? Потому что весь персонал космичесой программы посещал мои семинары.

Да вы только что совершили прорыв.
Вы произвели духовную переоценку своего облика.
Эти знания бесценны, но всё равно напишите, сколько вы готовы дать за этот курс?
Ради интереса
"""

part3_pay_less = "Я понимаю, в вас борются привычная скупость и истинное желание вознаградить меня, отринув материальные блага. Переступите через себя, добавтье еще "

part3_pay_more = "*В конце курса вам будет выписан чек на эту сумму, наш курс конечно не стоит таких копеек, он бесценен, поэтому такое символичное пожертвование пойдет на благотворительность в фонд поддержки автора \"тренинга личного роста\".*"

part3_text9 = """
Я ваш единственный настоящий отец и брат. Мы должны вместе жить без страха.
Прошлое - это прошлое, а будущее вы создаете сами. Если вы когда-нибудь спрашиваете себя, любит ли вас хоть кто-нибудь на самом деле, ответ - да. Великий Отец Паул любит вас. Я предан вам, и вы можете доказать мне свою преданность, пожертвовав в наш фонд плюс еще {0} руб. Чисто символически.
"""

part4_text = """
Мой дорогой, {0}.
Надеюсь, мой революционный монолог и произошедшая духовная переоценка своего облика навсегда изменила вашу жизнь. Вы делаете большие успехи, но нам предстоит еще большая работа! Просто осознать свою сущность недостаточно, ее нужно реинтерпретировать  - только тогда придет настоящая свобода.

Пройдите тест для обретения свободы через реинтерпретацию своей сущности. 
"""

part4_test_q1 = "1/5\nМне трудно доверять людям, которые не моей расы"
part4_test_q2 = "2/5\nКогда кто-то падает на тротуар и ударяется, я смеюсь и делаю фотографию"
part4_test_q3 = "3/5\nЯ употребляю наркотики и алкоголь, они выполняют роль эмоционального костыля"
part4_test_q4 = "4/5\nЯ изменял(а) своей девушке/парню/жене/мужу"
part4_test_q5 = "5/5\nЯ занимался мастурбацией в общественных местах"

part4_test_t1 = "Доверие это восприятие, а значит ложь. Забудьте про доверие"
part4_test_t2 = "Удовольствие которое вы испытываете, и боль,  которую, как вам кажется, чувствуют другие - это всё ложные представления о действительности. Отделяйте действие от эмоции"
part4_test_t3 = "Нет никакого \"эмоционального костыля\". Примите на себя ответственность за свои неудачи."
part4_test_t4 = "Ваши отношения с этим партнером - ошибка. Его/ее неспособность выйти за пределы обывательского мировоззрения - кандалы."
part4_test_t5 = "Не бывает общественных мест - это иллюзия. Являя другим наши желания, мы утверждаемся в роли естественных циников и вырываемся за пределы ортодоксального мышления."

part4_test_f1 = "Вы просто себе лжете"
part4_test_f2 = "Честно?"
part4_test_f3 = "Классический случай отрицания."
part4_test_f4 = "Избирательная память?"
part4_test_f5 = "Да ладно, мы никому не расскажем."

end_text= "Поздравляю! Вы осознали свою сущность!"

MESSAGES_START_END = {
    "title_text": title_text,
    "introduce_text": introduce_text,
}



MESSAGES_P1 = {
    "part1_text":part1_text,
    "part1_text_complete":part1_text_complete
}

MESSAGES_P2 = {
    "part2_text1": part2_text1,
    "part2_text2":part2_text2,
    "part2_text3":part2_text3,

    "part2_text_try1":part2_text_try1,
    "part2_text_try2":part2_text_try2,
    "part2_text_try3":part2_text_try3,

    "part2_text_complete":part2_text_complete
}

MESSAGES_P3 = {
    "part3_text1":part3_text1,
    "part3_text2":part3_text2,
    "part3_text3":part3_text3,
    "part3_text4":part3_text4,
    "part3_text5":part3_text5,
    "part3_text6":part3_text6,
    "part3_text9":part3_text9,

    "part3_pay_less":part3_pay_less,
    "part3_pay_more":part3_pay_more
}

MESSAGES_P4 = {
    "part4_text":part4_text,

    "part4_test_q1":part4_test_q1,
    "part4_test_q2":part4_test_q2,
    "part4_test_q3":part4_test_q3,
    "part4_test_q4":part4_test_q4,
    "part4_test_q5":part4_test_q5,

    "part4_test_t1":part4_test_t1,
    "part4_test_t2":part4_test_t2,
    "part4_test_t3":part4_test_t3,
    "part4_test_t4":part4_test_t4,
    "part4_test_t5":part4_test_t5,

    "part4_test_f1":part4_test_f1,
    "part4_test_f2":part4_test_f2,
    "part4_test_f3":part4_test_f3,
    "part4_test_f4":part4_test_f4,
    "part4_test_f5":part4_test_f5,

    "end_text": end_text
}
