title_text = "Курс познания себя"

introduce_text = """
Ученые из гарвардского университета доказали, что люди, проходят 2 фазы: простой обыватель и человек, прошедший наш курс.

Человек - это "люди", но только в единственном числе. 

Перечитайте всё это. Потом перечитайте еще раз, позвоните другу и расскажите ему об этом. Возможно, это самое важное, что вы когда-либо прочтете в интернете.


Пройдите бесплатный анализ сущности. Узнайте всё сами. Узнайте всю правду о себе. Вы готовы потратить 5 минут ради полноценной жизни?
"""
part1_text = "Посмотрите изображения и выберите ответы которые лучше всего отражают вашу реакцию. Отвечайте быстро и честно."

part1_text_complete = """
Вам не хватает личного и профессионального удовлетворения. Вы испытываете глубочайший личностный кризис, но вы сделали важный шаг к осознанию своей сущности.
Поздравляем, вы уже прошли первый этап нашего уникального процесса самосовершенствования. Чтобы продолжить путь к просветлению, который прошли уже миллионы людей по всему миру, щелкните по кнопке ниже.

*щелкнув по кнопке здесь, вы принимаете 92-страничное соглашение, особождающее нас от ответственности в случае возникновения эмоциональных проблем, морального вреда или материальных издержек.
"""

part2_text1 = "Добро пожаловать в процесс. Вы присоединились к миллионам людей, которые идут по чудесному и исключительно экономичному пути к миру, свободе и просветлению."

part2_text2 = """
Наш тренинг состоит из 4 этапов: 
1 - Осознание своей сущности
2- Принятие своей тщетности
3- Духовная переоценка своего облика
4- Обретение свободы через реинтерпретацию своей сущности
"""

part2_text3 = """
Напишите ответ на загадку:
"Зимой и летом одним цветом"
У вас есть 3 попытки.
"""

part2_text_try1 = """
Вы мыслите стандартно
Осталось 2 попытки
"""
part2_text_try2 = """
Раскройте свое сознание, подумайте еще.
Осталось 1 попытка
"""
part2_text_try3 = """
Я разочарован
"""

part2_text_complete = """
Правильный ответ был "зеркало".

Духовная подавленность притупила ваши инстинкты и затуманила ваш разум. Вы эмоционально опустошены, но самоосознание и принятие ответственности - вот ключи к раскрепощению.
Только усмирив собственное эго и приняв тщетность своих усилий, мы можем использовать нашу завершенность, открыв в себе новое измерение.

Это была загадка, которую вы, разумеется не разгадали, но зато вы усвоили важный урок.
"""


part3_text1 = "Поздравляю вас с успехами. Сейчас вы на третьей стадии из четырех запатентованного процесса просветления, и уже близки к тому, чтобы обладать ортодоксальным мышлением и начать использовать это слово в своем словарном запасе."

part3_text2 = """
Чтобы вырваться из замкнутоко круга ошибок и нереализованных возможностей, вы должны изменить фундаментальные представления. Вам нужно перестать работать с восприятием и начать работать с реальностью.
"""

part3_text3 = """
Болезнь - это иллюзия, симптом негативного мышления. Используйте свое сознание как целительную силу. 

Посмотрите в лицо своим страхам. 
Боитесь машин? Переходите дорогу на красный свет. 
Боитесь коллекторов? Наберите микрозаймов.
"""

part3_text4 = """
Там, где есть больше одного истолкования, нет истины. Только восприятие. 
Как вы думаете, почему нам удалось доставить внедорожник на Марс? Потому что весь персонал космичесой программы посещал мои семинары.

Да вы только что совершили прорыв.
Вы произвели духовную переоценку своего облика.
Эти знания бесценны, но всё равно напишите, сколько вы готовы дать за этот курс?
Ради интереса
"""

part3_pay_less = "Я понимаю, в вас борются привычная скупость и истинное желание вознаградить нас. Отринув материальные блага, переступите через себя, добавтье еще "

part3_pay_more = "*В конце курса вам будет выписан чек на эту сумму, наш курс конечно не стоит таких копеек, он бесценен, поэтому такое символичное пожертвование пойдет на благотворительность в фонд поддержки автора \"тренинга личного роста\".*"

part3_text9 = """
Я ваш единственный настоящий отец и брат. Мы должны вместе жить без страха.
Прошлое - это прошлое, а будущее вы создаете сами. Если вы когда-нибудь спрашиваете себя, любит ли вас хоть кто-нибудь на самом деле, ответ - да. Мы любим вас. Мы преданы вам, и вы можете доказать нам свою преданность, пожертвовав в наш фонд плюс еще {0} руб. Чисто символически.
"""

part4_text = """
Наш дорогой, {0}.
Надеюсь, наш революционный монолог и произошедшая духовная переоценка своего облика навсегда изменила вашу жизнь. Вы делаете большие успехи, но нам предстоит еще большая работа! Просто осознать свою сущность недостаточно, ее нужно реинтерпретировать  - только тогда придет настоящая свобода.

Пройдите тест для обретения свободы через реинтерпретацию своей сущности. 
"""

part4_test_q1 = "1/5\nМне легко доверять людям, которых я не знаю и не видел"
part4_test_q2 = "2/5\nЯ не сочуствую человеку, если он больно ударяется"
part4_test_q3 = "3/5\nЯ каждый день употребляю алкоголь, они выполняют роль эмоционального костыля"
part4_test_q4 = "4/5\nЯ не считаю себя уникальным"
part4_test_q5 = "5/5\nЯ иногда прогуливал уроки в школе"

part4_test_t1 = "Доверие это восприятие, а значит ложь. Забудьте про доверие"
part4_test_t2 = "Сочуствие и боль,  которую, как вам кажется, чувствуют другие - это всё ложные представления о действительности. Отделяйте действие от эмоции"
part4_test_t3 = "Нет никакого \"эмоционального костыля\". Примите на себя ответственность за свои неудачи."
part4_test_t4 = "Не волнуйтесь, решение простое - ничего не показывает вашу индивидуальность так, как футболка с принтом или ник в игре."
part4_test_t5 = "Прогуливая школу вы показывали то, что у вас есть свои желания и то, что вы не стадо. Идите дальше - прогуливайте работу."

part4_test_f1 = "Вы только недавно, согласились отправить нам деньги, не лгите себе."
part4_test_f2 = "Подумайте еще"
part4_test_f3 = "Классический случай отрицания."
part4_test_f4 = "Все считают себя уникальными, считая так же вы становитесь как все."
part4_test_f5 = "Да ладно, мы никому не расскажем."

end_text= "Поздравляю! Вы познали себя!"

MESSAGES_START_END = {
    "title_text": title_text,
    "introduce_text": introduce_text,
}



MESSAGES_P1 = {
    "part1_text":part1_text,
    "part1_text_complete":part1_text_complete
}

MESSAGES_P2 = {
    "part2_text1": part2_text1,
    "part2_text2":part2_text2,
    "part2_text3":part2_text3,

    "part2_text_try1":part2_text_try1,
    "part2_text_try2":part2_text_try2,
    "part2_text_try3":part2_text_try3,

    "part2_text_complete":part2_text_complete
}

MESSAGES_P3 = {
    "part3_text1":part3_text1,
    "part3_text2":part3_text2,
    "part3_text3":part3_text3,
    "part3_text4":part3_text4,
    "part3_text9":part3_text9,

    "part3_pay_less":part3_pay_less,
    "part3_pay_more":part3_pay_more
}

MESSAGES_P4 = {
    "part4_text":part4_text,

    "part4_test_q1":part4_test_q1,
    "part4_test_q2":part4_test_q2,
    "part4_test_q3":part4_test_q3,
    "part4_test_q4":part4_test_q4,
    "part4_test_q5":part4_test_q5,

    "part4_test_t1":part4_test_t1,
    "part4_test_t2":part4_test_t2,
    "part4_test_t3":part4_test_t3,
    "part4_test_t4":part4_test_t4,
    "part4_test_t5":part4_test_t5,

    "part4_test_f1":part4_test_f1,
    "part4_test_f2":part4_test_f2,
    "part4_test_f3":part4_test_f3,
    "part4_test_f4":part4_test_f4,
    "part4_test_f5":part4_test_f5,

    "end_text": end_text
}
